<?php

namespace app\Models;
use Illuminate\Database\Eloquent\Model;
use Illuminate\Support\Arr;

class Employee extends Model
{
    protected $table = 'employee';
    protected $fillable = ['workId', 'firstName', 'middleName' ,'lastName', 'email', 'phoneNo', 'position', 'sector', 'nationalId', 'joined', 'dateOfBirth'];

}


// quick insert example data

// INSERT INTO employee (workId, firstName, lastName, email, phoneNo, position, sector, nationalId, joined, dateOfBirth) VALUES
// ("WK001", "محمد", "الغامدي", "victoria35@yahoo.com", "0523598463", "مهندس DevOps", "IT", "0367098895", "2024-05-10", "1988-09-30"),
// ("WK002", "أحمد", "العمر", "taylor46@gmail.com", "0580345975", "مصرفي استثماري", "Finance", "6860730113", "2020-02-14", "1981-01-20"),
// ("WK003", "فاطمة", "السبيعي", "jasonlong@gmail.com", "0593723965", "مدير مبيعات", "Sales", "5688507109", "2022-02-04", "1984-10-22"),
// ("WK004", "محمد", "الشمراني", "nmoore@hotmail.com", "0584445946", "مهندس DevOps", "IT", "7118060209", "2021-05-01", "1978-11-24"),
// ("WK005", "علي", "القحطاني", "amanda23@hotmail.com", "0573257366", "منسق لوجستي", "Operations", "1803996466", "2023-09-06", "2002-08-08"),
// ("WK006", "محمد", "العمر", "shaun95@peters.biz", "0574802274", "تطوير الأعمال", "Sales", "5792240819", "2020-08-03", "1970-12-27"),
// ("WK007", "محمد", "العطار", "lisaharris@nguyen-wise.org", "0552678851", "مدير مبيعات", "Sales", "5698189839", "2023-10-01", "1974-01-17"),
// ("WK008", "سارة", "العنزي", "rocharobert@hotmail.com", "0539044242", "مسؤول نظام", "IT", "0870160272", "2019-12-22", "1975-09-20"),
// ("WK009", "عبدالله", "القحطاني", "rojasryan@king.com", "0566646127", "عالم بيانات", "IT", "6967900769", "2020-02-21", "1981-12-28"),
// ("WK010", "أحمد", "الزهراني", "mullenashley@jones-glenn.com", "0586336311", "أخصائي SEO", "Marketing", "7074641032", "2020-06-24", "1997-10-29"),
// ("WK011", "سارة", "الشمراني", "zvillarreal@gmail.com", "0586721569", "مسؤول نظام", "IT", "3353228645", "2020-08-17", "1971-07-12"),
// ("WK012", "نورة", "الغامدي", "lambertdorothy@hotmail.com", "0549231688", "محلل مالي", "Finance", "9841686659", "2021-11-04", "1980-07-27"),
// ("WK013", "أحمد", "الشمراني", "asanchez@freeman.biz", "0524628894", "تطوير الأعمال", "Sales", "0827083625", "2023-06-27", "1979-01-06"),
// ("WK014", "عبدالله", "العمر", "sandra36@yahoo.com", "0557061697", "مدير عمليات", "Operations", "0076683662", "2022-07-04", "2001-01-07"),
// ("WK015", "علي", "الدوسري", "vpena@collins-hanson.biz", "0598638580", "مدير الموارد البشرية", "HR", "4134764382", "2023-05-25", "1990-06-20"),
// ("WK016", "خالد", "الدوسري", "joseph17@brown.com", "0532131666", "استراتيجي محتوى", "Marketing", "6887117176", "2022-10-23", "1982-04-04"),
// ("WK017", "عبدالله", "العنزي", "stephen18@gmail.com", "0589278296", "عالم بيانات", "IT", "6158729501", "2022-05-20", "1974-12-15"),
// ("WK018", "عبدالله", "العنزي", "christophermoore@yahoo.com", "0564251442", "محلل مالي", "Finance", "7056581185", "2023-06-04", "1978-10-20"),
// ("WK019", "سعود", "القحطاني", "alexandramartin@hotmail.com", "0572913315", "تطوير الأعمال", "Sales", "3465839246", "2022-08-12", "1984-08-27"),
// ("WK020", "مريم", "العنزي", "meyeremma@fox.net", "0564418016", "محلل سلسلة الإمداد", "Operations", "1385748892", "2020-09-12", "1980-03-26"),
// ("WK021", "عبدالله", "الدوسري", "williamsonrachel@hotmail.com", "0562498250", "محلل سلسلة الإمداد", "Operations", "7522644580", "2022-01-09", "1982-06-02"),
// ("WK022", "عبدالله", "الغامدي", "destiny98@gmail.com", "0566496436", "أخصائي موارد بشرية", "HR", "3887244466", "2021-09-09", "1971-12-30"),
// ("WK023", "علي", "القحطاني", "xrogers@phillips.com", "0549783453", "مدير تسويق", "Marketing", "4704124104", "2021-06-12", "1993-01-22"),
// ("WK024", "نورة", "العمر", "susandavis@daniels.org", "0543672667", "مدير عمليات", "Operations", "4048571148", "2022-08-23", "1977-05-21"),
// ("WK025", "سعود", "الدوسري", "drew15@yahoo.com", "0566950146", "مدير تسويق", "Marketing", "6166357524", "2022-10-26", "1966-09-15"),
// ("WK026", "علي", "العنزي", "zshelton@stewart.com", "0592460196", "مدير تسويق", "Marketing", "3526953982", "2022-01-23", "1998-08-10"),
// ("WK027", "خالد", "السبيعي", "hillalexis@gmail.com", "0537284146", "محاسب", "Finance", "3927082634", "2021-04-27", "1986-04-12"),
// ("WK028", "محمد", "القحطاني", "heather42@lewis.org", "0566561271", "عالم بيانات", "IT", "3647343280", "2022-05-19", "1981-09-05"),
// ("WK029", "سعود", "العنزي", "rudyhall@carson.info", "0552514538", "مدير تسويق", "Marketing", "3370952525", "2023-03-24", "1995-12-06"),
// ("WK030", "فاطمة", "العمر", "melissasnyder@murphy-davis.biz", "0587491813", "مدير الموارد البشرية", "HR", "4646421722", "2022-06-02", "1983-04-11"),
// ("WK031", "عبدالله", "السبيعي", "guerraedward@owen.com", "0537041388", "مسؤول نظام", "IT", "7792036942", "2022-12-16", "1972-01-22"),
// ("WK032", "مريم", "العنزي", "tylerjames@hotmail.com", "0562856628", "عالم بيانات", "IT", "2196631381", "2022-07-30", "1982-02-18"),
// ("WK033", "خالد", "الدوسري", "chrisruiz@rodriguez.com", "0585102797", "مدير مبيعات", "Sales", "6091404205", "2022-06-01", "1968-01-24"),
// ("WK034", "سعود", "الدوسري", "zschwartz@smith-wright.com", "0586267627", "مدير الموارد البشرية", "HR", "1010479187", "2022-12-18", "1991-07-09"),
// ("WK035", "علي", "العنزي", "yhernandez@bryant.biz", "0551378420", "عالم بيانات", "IT", "6036582730", "2022-06-22", "1984-06-04"),
// ("WK036", "سعود", "الشمراني", "danielrobertson@gmail.com", "0589201844", "محلل مالي", "Finance", "7876855203", "2022-10-27", "1996-03-03"),
// ("WK037", "خالد", "العنزي", "kyleprice@smith.com", "0596167812", "مدير تسويق", "Marketing", "6008835892", "2022-11-18", "1979-04-12"),
// ("WK038", "عبدالله", "العنزي", "qking@clark-shepherd.com", "0576177036", "عالم بيانات", "IT", "8128708507", "2020-11-06", "1987-06-01"),
// ("WK039", "فاطمة", "الزهراني", "jessica52@hotmail.com", "0558380933", "عالم بيانات", "IT", "7696882342", "2021-10-13", "1991-02-07"),
// ("WK040", "فاطمة", "الشمراني", "gentryethan@solis.info", "0593679488", "محلل سلسلة الإمداد", "Operations", "0080806081", "2020-05-26", "1983-10-27"),
// ("WK041", "علي", "العمر", "vferguson@richardson.net", "0566812027", "مسؤول نظام", "IT", "9899698034", "2020-05-14", "1987-06-26"),
// ("WK042", "نورة", "العمر", "jcarpenter@taylor.org", "0577271084", "عالم بيانات", "IT", "3120512432", "2020-07-23", "1993-12-31"),
// ("WK043", "نورة", "القحطاني", "katiesantos@nelson.com", "0554264565", "مسؤول نظام", "IT", "1570144148", "2020-11-01", "1979-09-23"),
// ("WK044", "محمد", "العنزي", "courtneymonroe@yahoo.com", "0597918037", "مدير الموارد البشرية", "HR", "8787447608", "2023-08-10", "1972-09-18"),
// ("WK045", "علي", "الغامدي", "jamie94@gmail.com", "0583129409", "مدير عمليات", "Operations", "8361934708", "2022-05-26", "1993-11-10"),
// ("WK046", "عبدالله", "الشمراني", "hunterbrandon@lee-wilson.com", "0588402248", "مدير تسويق", "Marketing", "1731227734", "2021-08-19", "1981-08-28"),
// ("WK047", "خالد", "الغامدي", "jennifer38@lopez.com", "0542015176", "أخصائي موارد بشرية", "HR", "4300179343", "2023-09-20", "1997-07-28"),
// ("WK048", "سارة", "العمر", "juliacabrera@montgomery.net", "0593761022", "عالم بيانات", "IT", "3507632434", "2022-06-09", "1975-01-13"),
// ("WK049", "محمد", "الشمراني", "alexismoreno@baker-lee.org", "0552194371", "مدير الموارد البشرية", "HR", "7478619227", "2022-04-25", "1991-12-06"),
// ("WK050", "علي", "العنزي", "amandahall@ramos.net", "0555231096", "أخصائي توظيف", "HR", "2386987076", "2020-10-11", "1987-10-20"),
// ("WK051", "عبدالله", "العمر", "sfreeman@hotmail.com", "0536497361", "أخصائي موارد بشرية", "HR", "0129796358", "2021-09-01", "1996-02-29"),
// ("WK052", "سعود", "العمر", "smorales@martin.com", "0595448590", "عالم بيانات", "IT", "0144161078", "2020-01-17", "1983-04-10"),
// ("WK053", "فاطمة", "الشمراني", "hbrown@garcia.com", "0547497794", "محلل مالي", "Finance", "3766258150", "2022-09-22", "1996-05-21"),
// ("WK054", "علي", "الشمراني", "william92@gmail.com", "0552856273", "عالم بيانات", "IT", "9023020035", "2023-08-09", "1997-05-10"),
// ("WK055", "عبدالله", "القحطاني", "felicia67@hotmail.com", "0539415682", "محاسب", "Finance", "2585374974", "2021-01-19", "1998-09-15"),
// ("WK056", "عبدالله", "السبيعي", "cameron06@hotmail.com", "0562016294", "تطوير الأعمال", "Sales", "2786098923", "2023-09-12", "1987-12-11"),
// ("WK057", "خالد", "الغامدي", "jeremiah92@nguyen.com", "0552972258", "مدير عمليات", "Operations", "5286144306", "2020-06-29", "1973-11-19"),
// ("WK058", "سعود", "الدوسري", "vward@morales-lee.com", "0576684245", "مسؤول نظام", "IT", "8010656613", "2021-04-02", "1990-01-25"),
// ("WK059", "خالد", "السبيعي", "hfowler@nguyen.com", "0584665726", "مدير تسويق", "Marketing", "1754086660", "2021-11-14", "1990-01-26"),
// ("WK060", "فاطمة", "الشمراني", "meyersjeffrey@gmail.com", "0545360033", "محلل سلسلة الإمداد", "Operations", "2538230740", "2021-07-20", "1979-01-16"),
// ("WK061", "نورة", "القحطاني", "stephanie78@gmail.com", "0531044657", "أخصائي موارد بشرية", "HR", "6807304705", "2021-04-01", "1988-12-08"),
// ("WK062", "محمد", "العنزي", "richardsbarbara@gmail.com", "0539178976", "مسؤول نظام", "IT", "1782744701", "2022-12-21", "1986-01-02"),
// ("WK063", "محمد", "العنزي", "juliaknight@walker-hill.biz", "0579372075", "أخصائي موارد بشرية", "HR", "5063555917", "2022-12-15", "1997-11-01"),
// ("WK064", "سعود", "العنزي", "amberwhite@hotmail.com", "0544290103", "تطوير الأعمال", "Sales", "0177784164", "2021-05-04", "1983-09-27"),
// ("WK065", "خالد", "الشمراني", "vbrady@yahoo.com", "0566361064", "أخصائي موارد بشرية", "HR", "7641516061", "2022-04-11", "1982-12-20"),
// ("WK066", "سارة", "الدوسري", "gsummers@conway.com", "0563863763", "مدير عمليات", "Operations", "8914205221", "2021-10-10", "1978-08-09"),
// ("WK067", "محمد", "العنزي", "billyjones@hotmail.com", "0571551517", "محاسب", "Finance", "6262656776", "2023-09-17", "1988-06-29")

